<template>
  <div style="margin-top: 50px">
    <el-form :model="value" :rules="rules" ref="productInfoForm" label-width="120px" style="width: 1200px" size="small">
      <div>请仔细阅读以下供应商入驻服务协议及规则：</div>
      <p>用户使用“四川乐享拍网络科技有限公司在线供应商入驻系统”前，请认真阅读并理解本协议内容，本协议内容中以加粗方式显著标识的条款，请用户着重阅读、慎重考虑。</p> 
<p>1.本协议的订立
依据《四川乐享拍网络科技有限公司商城网站用户注册协议》登记注册，且符合本公司供应商入驻标准的用户（以下简称“供应商”），在同意本协议全部条款后，方有资格使用“四川乐享拍网络科技有限公司在线供应商入驻系统”（以下简称“供应商入驻系统”） 申请入驻。一经供应商点击“我已阅读并且同意以上服务协议”按键，即意味着供应商同意与本公司签订本协议并同意受本协议约束。</p> 
<p>2.入驻系统使用说明</p>
<p>2.1 供应商通过入驻系统提出入驻申请，并按照要求填写供应商信息、提供供应商资质资料后，由本公司审核并与有合作意向的供应商联系协商合作相关事宜，经双方协商一致线下签订书面《产品购销协议》（以下简称“购销协议”），且供应商按照“购销协议”约定支付相应保证金等必要费用后，供应商可申请开通后台系统操作权限。<br>
2.2 供应商以及本公司通过入驻系统做出的申请、资料提交及确认等各类沟通，仅为双方合作的意向以及本公司对供应商资格审核的必备程序，除遵守本协议各项约定外，对双方不产生法律约束力。双方间最终合作事宜及运营规则均以“购销协议”的约定及供应商后台系统公示的各项规则为准。</p>
<p>3.供应商权利义务</p>
<p>3.1 供应商应查看本公司公示的入驻供应商标准，并确保资质符合本公司公示的基本要求，供应商知悉并理解本公司将结合自身业务发展情况对供应商进行选择。<br>
3.2 供应商应按照本公司要求诚信提供入驻申请所需资料并如实填写相关信息，供应商应确保提供的申请资料及信息真实、准确、完整、合法有效，经本公司审核通过后，供应商不得擅自修改替换相应资料及主要信息。如供应商提供的申请资料及信息不合法、不真实、不准确的，供应商需承担因此引起的相应责任及后果，并且本公司有权立即终止供应商使用入驻系统的权利。<br>
3.3 供应商使用入驻系统提交的所有内容应不含有木马等软件病毒、政治宣传、或其他任何形式的“垃圾信息”、违法信息，且供应商应按本公司规则使用入驻系统，不得从事影响或可能影响本公司或入驻系统正常运营的行为，否则，本公司有权清除前述内容，并有权立即终止供应商使用入驻系统的权利。<br>
3.4 供应商应注意查看入驻系统公示的入驻申请结果，如审核通过的供应商，则按照本公司工作人员的通知按要求办理入驻的相关手续；如审批未通过的供应商，则可自本公司通过入驻系统将审批结果告知供应商（需供应商登陆入驻系统查看）之日起 15 日内提出异议并提供相应资料，如审批仍未通过的，则供应商同意提交的申请资料及信息本公司无需返还，由本公司自行处理。<br>
3.5 供应商不得以任何形式擅自转让或授权他人使用自己在本公司的用户帐号使用入驻系统，否则由此产生的不利后果均由供应商自行承担。</p>
<p>4.本公司权利义务</p>
<p>4.1 本公司开发的入驻系统仅为供应商申请入驻的平台，供应商正式入驻后，将在供应商后台系统中进行相关操作。<br>
4.2 本公司有权对供应商提供的资料及信息进行审核，并有权结合自身业务情况对合作供应商进行选择；本公司对供应商提交资料及信息的审核均不代表本公司对审核内容的真实、合法、准确、完整性作出的确认，供应商应对提供资料及信息承担相应的法律责任。<br>
4.3 无论供应商是否通过本公司的审核，本公司有权对供应商提供的资料及信息予以留存并随时查阅，同时，本公司有义务对供应商提供的资料予以保密，但国家行政机关、司法机关等国家机构调取资料的除外。<br>
4.4 本公司会尽力维护本系统信息的安全，但法律规定的不可抗力，以及因为黑客入侵、计算机病毒侵入发作等原因造成供应商资料泄露、丢失、被盗用、被篡改的，本公司不承担任何责任。<br>
4.5 本公司应在现有技术支持的基础上确保入驻系统的正常运营，尽量避免入驻系统服务的中断给供应商带来的不便。<p>
<p>5.知识产权</p>
<p>5.1 本公司开发的入驻系统及其包含的各类信息的知识产权归本公司所有者所有，受国家法律保护,本公司有权不时地对入驻系统的内容进行修改，并在入驻系统中公示，无须另行通知供应商。<br>
5.2 在法律允许的最大限度范围内，本公司所有者对本协议及入驻系统涉及的内容拥有解释权。<br>
5.3 供应商未经本公司所有者书面许可，不得擅自使用、非法全部或部分的复制、转载、抓取入驻系统中的信息，否则由此给本公司造成的损失，供应商应予以全部赔偿。</p>
<p>6.入驻系统服务的终止</p>
<p>6.1 供应商自行终止入驻申请，或供应商经本公司审批未通过的，则入驻系统服务自行终止。<br>
6.2 供应商使用本公司或入驻系统时，如违反相关法律法规或者违反本协议规定的，本公司有权随时终止供应商使用入驻系统。</p>
<p>7.本协议的修改</p>
<p>本协议可由本公司随时修订，并将修订后的协议公告于本公司及入驻系统，修订后的条款内容自公告时起生效，并成为本协议的一部分。</p>
<p>8.法律适用与争议解决</p>
<p>8.1 本协议适用中华人民共和国法律。<br>
8.2 因本协议产生的任何争议，由双方协商解决，协商不成的，任何一方有权向有管辖权的中华人民共和国大陆地区法院提起诉讼。</p>
 <el-checkbox v-model="checked">我已阅读以上协议</el-checkbox>
      <el-form-item style="text-align: center">
        <el-button type="primary" size="medium" @click="handleNext('productInfoForm')">同意</el-button>
      </el-form-item>
    </el-form>
  </div>
</template>

<script>
  export default {
    name: "ProductInfoDetail",
    props: {
      value: Object,
    },
    data() {
      return {
        checked:true,
        rules: {
          checked: [
            {required: true, message: '必选', trigger: 'blur'}
          ]
        }
      };
    },
    methods: {
      handleNext(formName){
        this.$refs[formName].validate((valid) => {
          if (valid) {
            this.$emit('nextStep');
          } else {
            this.$message({
              message: '验证失败',
              type: 'error',
              duration:1000
            });
            return false;
          }
        });
      }
    }
  }
</script>

